const malayalamEnglishMapping = {
    vowels: {
      'അ': 'a', 'ആ': 'ā', 'ഇ': 'i', 'ഈ': 'ī',
      'ഉ': 'u', 'ഊ': 'ū', 'ഋ': 'ṛi', 'ൠ': 'r̄ī',
      'ഌ': 'lu', 'ൡ': 'lū', 'എ': 'e', 'ഏ': 'ē',
      'ഐ': 'ai', 'ഒ': 'o', 'ഓ': 'ō', 'ഔ': 'au',
    },
    consonants: {
      'ക': 'k', 'ഖ': 'kh', 'ഗ': 'g', 'ഘ': 'gh', 'ങ': 'ṅg',
      'ച': 'c', 'ഛ': 'ch', 'ജ': 'j', 'ഝ': 'jh', 'ഞ': 'ñj',
      'ട': 'ṭ', 'ഠ': 'ṭh', 'ഡ': 'ḍ', 'ഢ': 'ḍh', 'ണ': 'ṇ',
      'ത': 't', 'ഥ': 'th', 'ദ': 'd', 'ധ': 'dh', 'ന': 'n',
      'പ': 'p', 'ഫ': 'ph', 'ബ': 'b', 'ഭ': 'bh', 'മ': 'm',
      'യ': 'y', 'ര': 'r', 'ല': 'l', 'വ': 'v',
      'ശ': 'ś', 'ഷ': 'ṣ', 'സ': 's', 'ഹ': 'h',
      'ള': 'ḷ', 'ഴ': 'ẓh', 'റ': 'ṟ',
    },
    joiners: {
        '്': ''
    },
    modifiers: {
      '്': '', 'ാ': 'ā', 'ി': 'i', 'ീ': 'ī', 'ു': 'u', 'ൂ': 'ū',
      'ൃ': 'ṛ', 'ൄ': 'r̄', 'െ': 'e', 'േ': 'ē', 'ൈ': 'ai',
      'ൊ': 'o', 'ോ': 'ō', 'ൌ': 'au', 'ൗ': 'au'
    },
    modifiers_two: {
         'ം': 'ṁ', 'ഃ': 'ഃ',
      },
    chillu: {
      'ൽ': 'l', 'ൾ': 'ḷ', 'ൺ': 'ṇ',
      'ൻ': 'n', 'ർ': 'ṟ', 'ൿ': 'k',
    },
    numerals: {
      '൦': '0', '൧': '1', '൨': '2', '൩': '3',
      '൪': '4', '൫': '5', '൬': '6', '൭': '7',
      '൮': '8', '൯': '9',
    },
    punctuation: {
      '।': '|', '൏': ';', ' ': ' ',
    },
  };
  
  export default malayalamEnglishMapping;