const malayalamToHindiMapping = {
  vowels: {
    'അ': 'अ', 'ആ': 'आ', 'ഇ': 'इ', 'ഈ': 'ई',
    'ഉ': 'उ', 'ഊ': 'ऊ', 'ഋ': 'ऋ', 'ൠ': 'ॠ',
    'ഌ': 'ऌ', 'ൡ': 'ॡ', 'എ': 'ए', 'ഏ': 'ऐ',
    'ഐ': 'ऐ', 'ഒ': 'ओ', 'ഓ': 'औ', 'ഔ': 'औ',
  },
  consonants: {
    'ക': 'क', 'ഖ': 'ख', 'ഗ': 'ग', 'ഘ': 'घ', 'ങ': 'ङ',
    'ച': 'च', 'ഛ': 'छ', 'ജ': 'ज', 'ഝ': 'झ', 'ഞ': 'ञ',
    'ട': 'ट', 'ഠ': 'ठ', 'ഡ': 'ड', 'ഢ': 'ढ', 'ണ': 'ण',
    'ത': 'त', 'ഥ': 'थ', 'ദ': 'द', 'ധ': 'ध', 'ന': 'न',
    'പ': 'प', 'ഫ': 'फ', 'ബ': 'ब', 'ഭ': 'भ', 'മ': 'म',
    'യ': 'य', 'ര': 'र', 'ല': 'ल', 'വ': 'व',
    'ശ': 'श', 'ഷ': 'ष', 'സ': 'स', 'ഹ': 'ह',
    'ള': 'ळ', 'ഴ': '--', // Placeholder for 'ഴ'
    'റ': '--', // Placeholder for 'റ'
  },
  joiners: {
    '്': '्', // Virama
  },
  modifiers: {
    '്': '्', 'ാ': 'ा', 'ി': 'ि', 'ീ': 'ी', 'ു': 'ु', 'ൂ': 'ू',
    'ൃ': 'ृ', 'ൄ': 'ॄ', 'െ': 'े', 'േ': 'े', 'ൈ': 'ै',
    'ൊ': 'ो', 'ോ': 'ो', 'ൌ': 'ौ', 'ൗ': 'ौ',
  },
  modifiers_two: {
    'ം': 'ं', 'ഃ': 'ः',
  },
  chillu: {
    'ൽ': 'ल', 'ൾ': 'ळ', 'ൺ': 'ण',
    'ൻ': 'न', 'ർ': 'र', 'ൿ': 'क',
  },
  numerals: {
    '൦': '०', '൧': '१', '൨': '२', '൩': '३',
    '൪': '४', '൫': '५', '൬': '६', '൭': '७',
    '൮': '८', '൯': '९',
  },
  punctuation: {
    '।': '।', '൏': '--', // Placeholder for '൏'
    ' ': ' ',
  },
};

export default malayalamToHindiMapping;